Revit 2027 API
SpecTypeId.HeatGain Property
 Heat Gain, in discipline HVAC.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId HeatGain { get; }
Public Shared ReadOnly Property HeatGain As ForgeTypeId
	Get
public:
static property ForgeTypeId^ HeatGain {
	ForgeTypeId^ get ();
}
static member HeatGain : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace